sites/all/modules/queue2civicrm/tests/data/payments-init.json

{
	"php-message-class": "SmashPig\\CrmLink\\Messages\\DonationInterfaceFinalStatus",
	"contribution_tracking_id": "12345",
	"gateway": "testgateway",
	"order_id": "",
	"gateway_txn_id": "",
	"validation_action": "process",
	"payments_final_status": "complete",
	"payment_method": "paypal",
	"payment_submethod": "",
	"country": "IT",
	"amount": "2.00",
	"currency_code": "EUR",
	"server": "testpayments1002",
	"date": "1445990999"
}
